Sources/interTwoPhaseCentralFoam/tutorial/OscillatingColumn/constant/reactions
species
(
    gas
);

reactions
{
}
