Sources/interTwoPhaseCentralFoam/tutorial/OscillatingColumn/constant/thermo.compressibleGas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gas
{
    specie
    {
        nMoles      1;
        molWeight   20785; 
    }

    thermodynamics
    {
        Cp              1.4;
        Hf              0.0;
    }

    transport
    {
        mu              0.0;
        Pr              0.73;
    }
}


// ************************************************************************* //
