Sources/interTwoPhaseCentralFoam/tutorial/OscillatingColumn/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            centrotechHeRhoThermo;
    mixture         pureMixture;
    transport       centrotechTransport;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleEnthalpy;
}


mixture
{
    liquid
    {
        H2O;
    }
    specie
    {
        molWeight   9;
    }
    equationOfState
    {
        R            923.777777777777;
        rho0         10;
    }
    thermodynamics
    {
        Cp              1.0;
        Hf              0.0;
    }
    transport
    {
        mu              0;
        Pr              0.73;
    }

}


// ************************************************************************* //
