Sources/interTwoPhaseCentralFoam/tutorial/OscillatingColumn/system/probeControl
probes
{
    type            probes;

    // Where to load it from
    libs ( "libsampling.so" );

    // Name of the directory for probe data
    name            probes;

    // Write at same frequency as fields
    writeControl   timeStep;
    writeInterval  1;

    // Fields to be probed
    fields  (
                p
            );

    probeLocations
    (
        (-1.0 0.0 0.0)
        ( 1.0 0.0 0.0)
    );
}
