Sources/interTwoPhaseCentralFoam/tutorial/OscillatingColumn/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 2500
    volScalarFieldValue p 1
    volVectorFieldValue U ( 0 0 0 )
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell
    {
        box ( -0.1 -1 -1 ) ( 0.1 1 1 );
        fieldValues
        (
            volVectorFieldValue U ( 1 0 0 )
            volScalarFieldValue alpha.liquid 1
        );
    }
);


// ************************************************************************* //
